app/controllers/posts_controller.rb

  def index
    @posts = Post.order(created_at: :desc).page(params[:page])
---
SELECT  "posts".* FROM "posts"  ORDER BY "posts"."created_at" DESC LIMIT 6 OFFSET 0
SELECT COUNT(*) FROM "posts"

  def create
    @post = Post.new({content:params[:content],title:params[:title]})
    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("content", "title", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "qqq"], ["title", "qw"], ["created_at", "2019-05-26 13:27:34.473165"], ["updated_at", "2019-05-26 13:27:34.473165"]]

  def update
    @post = Post.find_by(id:params[:id])
    @post.attributes = {content:params[:content],title:params[:title]}
    respond_to do |format|
      if @post.save
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "posts" SET "content" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["content", "abca"], ["updated_at", "2019-05-21 13:59:27.310117"], ["id", 1]]